fn main(){
    println!("\n=================");

    println!("型推論と型注釈\n");

    let guess: u32 = "42".parse().expect("数字じゃないよ！");
    //そのままでは複数の型を推論できるため、型注釈（: u32）が必要
    println!("guessの値：{guess}");

    println!("\n=================");

    println!("スカラー型\n");//単独の値
    
    //整数
    let integer : u32 = 1; //符号なし
    let integer2 : i32 = -1; //符号あり

    let integer_arch : usize = 2;//アーキテクチャ準拠
        //符号アリの場合はisize

    let integer_literal = 35u32;//複数サイズの型がありえる数値リテラルは接尾辞をつけてかける

    let integer_divided = 1_000;//_バーで区切れる

    //浮動小数点数
    let float64: f64 = 2.0;

    let float32: f32 = 3.0;

    //真偽値
    let t: bool = true;

    let f: bool = 1 < 0;

    //文字
    let single_char = 'c';//単独の文字型はシングルクォーテーションで囲む
        //文字列の場合はダブルクォーテーション

    let char_explicit: char = '📖';

    println!("
    整数
            符号なし整数：{integer}
            符号つき整数：{integer2}
            アーキテクチャ準拠：{integer_arch}
            型接尾辞つき：{integer_literal}
            アンダーバー区切り：{integer_divided}\n
    浮動小数点数
            64ビット：{float64}
            32ビット：{float32}\n
    真偽値
            真：{t}
            偽：{f}\n
    文字
            単独文字型：{single_char}
            型明示：{char_explicit}\n");

    println!("\n=================");

    println!("複合型\n");

    //タプル
    let tup:(i32,char,bool) = (500, 'a', true);//同時に複数の型を格納できる

    let (first, second, third) = tup;// タプルの分配

    let a = tup.1;//ドット記法で値にアクセスできる

    let _unit = ();//値を持たないタプルを「ユニット」という

    
    //配列
    let array_number = [1, 2, 3, 4, 5];//全ての要素が同じ型でなくてはいけない

    let third_number = array_number[2];//取り出し

    let array_char: [char; 3] = ['a', 'b', 'c'];//name: [type; length]で型と要素数を指定できる
    let b = array_char[1];
    
    let array_char = ['d'; 2];//[新要素名; 要素数]を格納することで初期化できる
    let d = array_char[0];

        //rustの配列はスタック領域で管理される

    println!("
    タプル
            first:{first}
            second:{second}
            third:{third}
            a:{a}\n
    配列
            ThirdNumber:{third_number}
            b:{b}
            d:{d}
");
    
}